src/DataProcessors/ЗагрузкаВыпискиБанка/ЗагрузкаВыпискиБанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаВыпискиБанка</name>
  <tabularSections>
    <name>ТаблицаОпераций</name>
    <attributes>
      <name>Загружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКлючевоеСлово</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кошелек</name>
      <type>
        <types>CatalogRef.КошелькиИСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>КошелекПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КошелекКлючевоеСлово</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДолг</name>
      <type>
        <types>CatalogRef.СтатьиРасходов</types>
        <types>CatalogRef.КошелькиИСчета</types>
        <types>CatalogRef.Долги</types>
        <types>CatalogRef.СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДолгПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДолгКлючевоеСлово</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперацииПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперацииКлючевоеСлово</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаОперацию</name>
      <type>
        <types>DocumentRef.ОбменВалюты</types>
        <types>DocumentRef.Доход</types>
        <types>DocumentRef.МыВзялиВДолг</types>
        <types>DocumentRef.МыВернулиДолг</types>
        <types>DocumentRef.НамВернулиДолг</types>
        <types>DocumentRef.МыДалиВДолг</types>
        <types>DocumentRef.Перемещение</types>
        <types>DocumentRef.Расход</types>
        <types>DocumentRef.УниверсальнаяОперация</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаОперациюПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаОперациюКлючевоеСлово</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперацииИконка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоступления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоступленияКлючевоеСлово</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСписания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСписанияКлючевоеСлово</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФинансоваяЦель</name>
      <type>
        <types>CatalogRef.ФинансовыеЦели</types>
      </type>
    </attributes>
    <attributes>
      <name>ФинансоваяЦельПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФинансоваяЦельКлючевоеСлово</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстСтрокиВыписки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АналитикаОпераций</name>
    <attributes>
      <name>ИДСтрокиОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыАналитик</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ВидыАналитик</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючевоеСлово</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/DataProcessors/ЗагрузкаВыпискиБанка/Forms/РедкаторАналитики/Module.bsl
////////////////////////////////////////////////////////////////////////////////
//Обработка.ЗагрузкаВыпискиБанка.Форма.РедкаторАналитики
//  Уточнение занчений аналитики в загружаемой операции
//  
//Параметры формы:
//  Стандартные параметры формы
//  
////////////////////////////////////////////////////////////////////////////////


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработаннаяСтрока = -1;
	ТаблицаАналитики.Загрузить(Параметры.ТаблицаАналитики.Выгрузить());
	Для каждого СтрокаАналитики Из ТаблицаАналитики Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаАналитики.Значение) И ЗначениеЗаполнено(СтрокаАналитики.КлючевоеСлово) Тогда
			СтрокаАналитики.Иконка = БиблиотекаКартинок.БыстроСоздатьЭлементСписка;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ТаблицаАналитики);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы

&НаКлиенте
Процедура ТаблицаАналитикиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ДанныеСтроки = Элементы.ТаблицаАналитики.ТекущиеДанные;
	
	Если ПустаяСтрока(Текст) И Не ЗначениеЗаполнено(ДанныеСтроки.Значение) Тогда
		Текст = ДанныеСтроки.Представление;
		ПараметрыПолученияДанных.СтрокаПоиска = ДанныеСтроки.Представление;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАналитикиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДанныеСтроки = Элементы.ТаблицаАналитики.ТекущиеДанные;
	
	ТипВыбранного = ТипЗнч(ВыбранноеЗначение);
	Если ТипВыбранного = Тип("Строка") Тогда
		ОбслуживаниеСправочниковКлиент.РасширенноеПолучениеДанныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ДанныеСтроки.Представление);
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура ТаблицаАналитикиПередНачаломИзменения(Элемент, Отказ)
	
	Если ОбработаннаяСтрока = Элементы.ТаблицаАналитики.ТекущаяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ОбработаннаяСтрока = Элементы.ТаблицаАналитики.ТекущаяСтрока;
	
	ДанныеСтроки = Элементы.ТаблицаАналитики.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Или не ЗначениеЗаполнено(ДанныеСтроки.ВидАналитики) Тогда
		Возврат;
	КонецЕсли;
	
	УточнитьПараметрыВыбора(ДанныеСтроки.ПолучитьИдентификатор());
	Элементы.ТаблицаАналитики.ИзменитьСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАналитикиЗначениеПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.ТаблицаАналитики.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Или не ЗначениеЗаполнено(ДанныеСтроки.ВидАналитики) Тогда
		Возврат;
	КонецЕсли;
	ДанныеСтроки.Иконка = ?(ЗначениеЗаполнено(ДанныеСтроки.Значение) Или Не ЗначениеЗаполнено(ДанныеСтроки.КлючевоеСлово), Новый Картинка, БиблиотекаКартинок.БыстроСоздатьЭлементСписка);
	ДанныеСтроки.Представление = ?(ЗначениеЗаполнено(ДанныеСтроки.Значение), СТрока(ДанныеСтроки.Значение), ДанныеСтроки.КлючевоеСлово);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАналитикиЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ДанныеСтроки = Элементы.ТаблицаАналитики.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Или не ЗначениеЗаполнено(ДанныеСтроки.ВидАналитики) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ДанныеСтроки.КлючевоеСлово = "";
	ДанныеСтроки.Представление = "";
	ДанныеСтроки.Значение = Неопределено;
	ДанныеСтроки.Иконка = Новый Картинка;
	
	Элементы.ТаблицаАналитики.ЗакончитьРедактированиеСтроки(Ложь);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УточнитьПараметрыВыбора(ИДСтроки)

	ДанныеСтроки = ТаблицаАналитики.НайтиПоИдентификатору(ИДСтроки);
	Если ДанныеСтроки = Неопределено Или не ЗначениеЗаполнено(ДанныеСтроки.ВидАналитики) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПоля = Новый Массив(Элементы.ТаблицаАналитикиЗначение.ПараметрыВыбора);
	Если ПараметрыПоля.Количество() > 2 Тогда
		ПараметрыПоля.Удалить(2);
	КонецЕсли;
	
	Источники = Новый Массив;
	ЕстьВладелец = Ложь;
	Для каждого Тип Из ДанныеСтроки.ВидАналитики.ТипЗначения.Типы() Цикл
		
		МетаданныеТипа = Метаданные.НайтиПоТипу(Тип);
		Если МетаданныеТипа= Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЭтоСправочник(МетаданныеТипа) Тогда
			Источники.Добавить(МетаданныеТипа.Имя);
			Если МетаданныеТипа.Владельцы.Количество() > 0 Тогда
				ЕстьВладелец = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	МассивСвязей = Новый Массив;
	Если ЕстьВладелец Тогда
		МассивСвязей.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", 
				"Элементы.ТаблицаАналитики.ТекущиеДанные.ВидАналитики", РежимИзмененияСвязанногоЗначения.Очищать));
	КонецЕсли;
	Элементы.ТаблицаАналитикиЗначение.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);
	
	Если Источники.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПоля.Добавить(Новый ПараметрВыбора("РасширенныйВыбор.ИсточникиДанных", Новый ФиксированныйМассив(Источники)));
	Элементы.ТаблицаАналитикиЗначение.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыПоля);
	
КонецПроцедуры


#КонецОбласти
